--- a/README.md
+++ b/README.md
@@ -104,45 +107,51 @@ started.
 
 ### Entities
 
-```puml
-!theme vibrant
-skinparam defaultFontSize 16
+```mermaid
+classDiagram
 
-entity Session {
-* id : string <<generated>>
---
-* name : string
-* secret : string <<encrypted | generated>>
-* participants: Participant[]
-* issues : Issue[]
-* scale : String[] 
+class Session {
+ + ObjectId id ~~generated~~
+ + string secret ~~generated~~ ~~encrypted~~
+ + Participant[] participants
+ + Issue[] issues
+ + string[] scale
 }
 
-entity Participant {
-* id : text <<generated>>
---
-* name : text
-* cookie : text <<encrypted | generated>>
-estimating : boolean
-away: boolean
+class Participant {
+  + ObjectId id ~~generated~~
+  + string? name
+  + boolean? estimating
+  + boolean? away
 }
 
-Session *-- "n" Participant 
+Session "1" *-- "*" Participant
 
-entity Issue {
-* esimations: Estimation[]
-* revealed : boolean
-* startedBy: string (id of Participant)
-name : string (only startedBy may set)
+class Issue {
+  + ObjectId id ~~generated~~
+  + string name
+  + ObjectId startedBy ~~Participant~~
+  + Round[] rounds
 }
-Session *-- "n" Issue
 
-entity Estimation {
-* participant : string (id of Participant)
-* estimation : number (Index of Session::scale)
+Session "1" *-- "*" Issue
+
+class Round {
+  + Estimation[] estimations
+  + boolean revealed
+  + ObjectId revealedBy ~~Participant~~
 }
-Issue *-- "n" Estimation
+
+Issue "1" *-- "1..*" Round
+
+class Estimation {
+  + ObjectId participant ~~Participant~~
+  + number estimation ~~scale~~
+}
+
+Round "1" *-- "*" Estimation
+
 ```
 
-<p align="right">(<a href="#readme-top">back to top</a>)</p>
 
